zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( converter_message_t ) );		// Queue can contain 5 elements of type converter_message_t
	if( xQueueConverter == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	// Wait until task is started by dispatcher		
	//vTaskSuspend(0);			
	
	xQueueReset(xQueueConverter);
	while(1)
	{

		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);


		switch(msg.type)
		{
			//=========================================================================//
			// Loading profile
			case CONVERTER_LOAD_PROFILE:
				// Disable converter if enabled
				if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
				{
					Converter_TurnOff();
				}
				converter_state.state = CONVERTER_STATE_OFF;		// Reset overloaded flag (if set)
				// Load profile data
				Converter_LoadProfile();
				// Wait until current feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);	
				// Apply new channel current range setting to hardware
				temp8u = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
				if (temp8u == CONVERTER_CMD_OK)
				{
					SetVoltageDAC(converter_state.channel->voltage.setting);
					SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
					SetOutputLoad(converter_state.channel->load_state);
					err_code = CMD_OK;
				}
				else
				{
					// Unexpected error for current range setting
					err_code = CMD_ERROR;
					Converter_TurnOff();
				} 
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = PROFILE_LOADED;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;
			//=========================================================================//
			// Saving profile
			case CONVERTER_SAVE_PROFILE:
				Converter_SaveProfile();
				// Confirm
				if (msg.pxSemaphore != 0)
					xSemaphoreGive(*msg.pxSemaphore);
				break;
			//=========================================================================//
			// Setting DAC offset
			case CONVERTER_SET_DAC_PARAMS:
				//taskDISABLE_INTERRUPTS();
				taskENTER_CRITICAL();
				global_settings->dac_voltage_offset = msg.a.dac_set.voltage_offset;
				global_settings->dac_current_low_offset = msg.a.dac_set.current_low_offset;
				global_settings->dac_current_high_offset = msg.a.dac_set.current_high_offset;
				//taskENABLE_INTERRUPTS();
				taskEXIT_CRITICAL();
				// Update DAC output
				SetVoltageDAC(converter_state.channel->voltage.setting);
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				// Confirm
					if (msg.pxSemaphore != 0)
						xSemaphoreGive(*msg.pxSemaphore);
				break;
/*			//=========================================================================//
			// Loading global settings
			case CONVERTER_LOAD_GLOBAL_SETTINGS:
				Converter_LoadGlobalSettings();
				// Confirm
				if (msg.pxSemaphore != 0)
					xSemaphoreGive(*msg.pxSemaphore);
				break;
			//=========================================================================//
			// Saving global settings
			case CONVERTER_SAVE_GLOBAL_SETTINGS:
				Converter_SaveGlobalSettings();
				// Confirm
				if (msg.pxSemaphore != 0)
					xSemaphoreGive(*msg.pxSemaphore);
				break;
*/			//=========================================================================//
			// Setting voltage
			case CONVERTER_SET_VOLTAGE:
				msg.a.v_set.channel = Converter_ValidateChannel(msg.a.v_set.channel);
				err_code = Converter_SetVoltage(msg.a.v_set.channel, msg.a.v_set.value);
				// Apply new setting to hardware. CHECKME: charge state
				if (msg.a.v_set.channel == converter_state.channel->CHANNEL)
				{
					SetVoltageDAC(converter_state.channel->voltage.setting);
				}
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = VOLTAGE_SETTING_CHANGE;
				dispatcher_msg.converter_event.channel = msg.a.v_set.channel;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Setting current
			case CONVERTER_SET_CURRENT:
				msg.a.c_set.channel = Converter_ValidateChannel(msg.a.c_set.channel);
				msg.a.c_set.range = Converter_ValidateCurrentRange(msg.a.c_set.range);
				err_code = Converter_SetCurrent(msg.a.c_set.channel, msg.a.c_set.range, msg.a.c_set.value);
				// Apply new setting to hardware. CHECKME: charge state
				if ((msg.a.c_set.channel == converter_state.channel->CHANNEL) && 
					(msg.a.c_set.range == converter_state.channel->current->RANGE))
				{
					SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				}
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = CURRENT_SETTING_CHANGE;
				dispatcher_msg.converter_event.channel = msg.a.c_set.channel;
				dispatcher_msg.converter_event.range = msg.a.c_set.range;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Setting voltage limit
			case CONVERTER_SET_VOLTAGE_LIMIT:
				msg.a.vlim_set.channel = Converter_ValidateChannel(msg.a.vlim_set.channel);
				err_code = Converter_SetVoltageLimit(msg.a.vlim_set.channel, msg.a.vlim_set.type, 
									msg.a.vlim_set.value, msg.a.vlim_set.enable);
				// Apply new setting to hardware. CHECKME: charge state				
				if (msg.a.vlim_set.channel == converter_state.channel->CHANNEL)
				{
					SetVoltageDAC(converter_state.channel->voltage.setting);
				}
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = VOLTAGE_LIMIT_CHANGE;
				dispatcher_msg.converter_event.channel = msg.a.vlim_set.channel;
				dispatcher_msg.converter_event.limit_type = msg.a.vlim_set.type;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break; 
			//=========================================================================//
			// Setting current limit
			case CONVERTER_SET_CURRENT_LIMIT:
				msg.a.clim_set.channel = Converter_ValidateChannel(msg.a.clim_set.channel);
				msg.a.clim_set.range = Converter_ValidateCurrentRange(msg.a.clim_set.range);				
				err_code = Converter_SetCurrentLimit(msg.a.clim_set.channel, msg.a.clim_set.range, msg.a.clim_set.type, 
									msg.a.clim_set.value, msg.a.clim_set.enable);
				// Apply new setting to hardware. CHECKME: charge state	
				if ((msg.a.clim_set.channel == converter_state.channel->CHANNEL) && 
					(msg.a.clim_set.range == converter_state.channel->current->RANGE))
				{
					SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				}
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = CURRENT_LIMIT_CHANGE;
				dispatcher_msg.converter_event.channel = msg.a.clim_set.channel;
				dispatcher_msg.converter_event.range = msg.a.clim_set.range;
				dispatcher_msg.converter_event.limit_type = msg.a.clim_set.type;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break; 
			//=========================================================================//
			// Setting channel
			case CONVERTER_SWITCH_CHANNEL:
				msg.a.ch_set.new_channel = Converter_ValidateChannel(msg.a.ch_set.new_channel);
				if (msg.a.ch_set.new_channel != converter_state.channel->CHANNEL)
				{
					// Disable converter if enabled
					if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
					{
						Converter_TurnOff();
						converter_state.state = CONVERTER_STATE_OFF;
					}
					// Wait until voltage feedback switching is allowed
					while(Converter_IsReady() == 0) 
						vTaskDelay(1);
					// Apply new channel setting to hardware
					temp8u = Converter_SetFeedBackChannel(msg.a.ch_set.new_channel);
					if (temp8u == CONVERTER_CMD_OK)
					{
						converter_state.channel = (msg.a.ch_set.new_channel == CHANNEL_5V) ? &converter_state.channel_5v : 
												&converter_state.channel_12v;
						while(Converter_IsReady() == 0) 
							vTaskDelay(1);	
						// Apply new channel current range setting to hardware
						temp8u = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
						if (temp8u == CONVERTER_CMD_OK)
						{
							SetVoltageDAC(converter_state.channel->voltage.setting);
							SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
							SetOutputLoad(converter_state.channel->load_state);
							err_code = CMD_OK;
						}
						else
						{
							// Unexpected error for current range setting
							err_code = CMD_ERROR;
							Converter_TurnOff();
						} 
					}
					else
					{
						// Unexpected error for channel setting
						err_code = CMD_ERROR;
						Converter_TurnOff();
					}
				}
				else
				{
					// Trying to set channel that is already selected.
					err_code = VALUE_BOUND_BY_ABS_MAX;
				}
				
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = CHANNEL_CHANGE;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Setting current range
			case CONVERTER_SET_CURRENT_RANGE:
				
