zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
				msg.a.crange_set.channel = Converter_ValidateChannel(msg.a.crange_set.channel);	
				msg.a.crange_set.new_range = Converter_ValidateCurrentRange(msg.a.crange_set.new_range);
				
				c = (msg.a.crange_set.channel == CHANNEL_5V) ? &converter_state.channel_5v : 
											&converter_state.channel_12v;
								
				if (msg.a.crange_set.new_range != c->current->RANGE)
				{
					// New current range differs from current
					if (msg.a.crange_set.channel == converter_state.channel->CHANNEL)
					{
						// Setting current range of the active channel
						if (converter_state.state != CONVERTER_STATE_ON)	// TODO: analyze charge state here
						{
							// Wait until current feedback switching is allowed
							while(Converter_IsReady() == 0) 
								vTaskDelay(1);	
							// Apply new channel current range setting to hardware
							temp8u = Converter_SetCurrentRange(msg.a.crange_set.new_range);
							if (temp8u == CONVERTER_CMD_OK)
							{
								c->current = (msg.a.crange_set.new_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
								SetCurrentDAC(c->current->setting, c->current->RANGE);
								err_code = CMD_OK;
							}
							else
							{
								// Unexpected error
								Converter_TurnOff();
								err_code = CMD_ERROR;
							}
						}
						else
						{
							// Converter in ON and current range cannot be changed
							err_code = CMD_ERROR;
						}
					}
					else
					{
						// Setting current range of the non-active channel
						c->current = (msg.a.crange_set.new_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
						err_code = CMD_OK;
					}
				}
				else
				{
					// Trying to set current range that is already selected.
					err_code = VALUE_BOUND_BY_ABS_MAX;
				}
				
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = CURRENT_RANGE_CHANGE;
				dispatcher_msg.converter_event.channel = msg.a.crange_set.channel;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Setting overload protection parameters
			case CONVERTER_SET_OVERLOAD_PARAMS:
				err_code = Converter_SetOverloadProtection( msg.a.overload_set.protection_enable, msg.a.overload_set.warning_enable, 
													msg.a.overload_set.threshold);
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = OVERLOAD_SETTING_CHANGE;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break; 
			//=========================================================================//
			// Turn ON
			case CONVERTER_TURN_ON:
				if ((converter_state.state == CONVERTER_STATE_OFF) || (converter_state.state == CONVERTER_STATE_OVERLOADED))
				{
					temp8u = Converter_TurnOn();
					if (temp8u == CONVERTER_CMD_OK)
					{
						converter_state.state = CONVERTER_STATE_ON;
						err_code = CMD_OK;
					}
					else
					{
						err_code = CMD_ERROR;
					}
				}
				else
				{
					// Converter is already ON
					err_code = CMD_OK;
				}
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_ON;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Turn OFF
			case CONVERTER_TURN_OFF:
				Converter_TurnOff();
				converter_state.state = CONVERTER_STATE_OFF;	// Reset overloaded state
				err_code = CMD_OK;
				// Send notification to dispatcher
				fillDispatchMessage(&msg, &dispatcher_msg);
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OFF;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break;
			//=========================================================================//
			// Overload
			case CONVERTER_OVERLOADED:
				// Hardware has been overloaded and disabled by low-level interrupt-driven routine.
				converter_state.state = CONVERTER_STATE_OVERLOADED;
				// Reset that routine FSM flag
				if (Converter_ClearOverloadFlag() == CONVERTER_CMD_OK)
				{
					// OK, flag has been reset.
					err_code = EVENT_OK;
				}	
				else
				{
					// Error, we should never get here.
					// Kind of restore attempt
					Converter_TurnOff();
					err_code = EVENT_ERROR;							
				}
				// Send notification to dispatcher
				dispatcher_msg.type = DISPATCHER_CONVERTER_EVENT;
				dispatcher_msg.sender = sender_CONVERTER;
				dispatcher_msg.converter_event.msg_type = 0;
				dispatcher_msg.converter_event.msg_sender = 0;
				dispatcher_msg.converter_event.spec = STATE_CHANGE_TO_OVERLOAD;
				dispatcher_msg.converter_event.err_code = err_code;
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
				break; 
			//=========================================================================//
			// Tick
			case CONVERTER_TICK:		// Temporary! Will be special for charging mode
				// ADC task is responsible for sampling and filtering voltage and current
				adc_msg = ADC_GET_ALL_NORMAL;
				xQueueSendToBack(xQueueADC, &adc_msg, 0);
				break;
				
			default:
				break;
		}
	}

}






